#+TITLE: DWSMS Planning file

* Planning [15/18]
  CLOCK: [2014-12-30 Tue 23:09]--[2014-12-31 Wed 00:22] =>  1:13
  CLOCK: [2014-12-28 Sun 12:08]--[2014-12-28 Sun 12:40] =>  0:32
  CLOCK: [2014-12-24 Wed 19:47]--[2014-12-24 Wed 20:59] =>  1:12

** DONE Get URL Resources loaded into DW server
** DONE Serve static files using AssetBundle
** DONE Should build simple HTML pages with FreeMarker backed views
** DONE Should use FreeMarker inheritance to have flexible html
** DONE Parse a user submitted date into a LocalDateTime object
   CLOCK: [2014-12-24 Wed 11:24]--[2014-12-24 Wed 11:30] =>  0:06
** DONE Load the date format string from config file, pass to whoever needs it
   CLOCK: [2014-12-24 Wed 11:30]--[2014-12-24 Wed 11:49] =>  0:19
** DONE Setup a timer task to eventually pull from Message Database
   CLOCK: [2014-12-24 Wed 13:47]--[2014-12-24 Wed 14:08] =>  0:21
** DONE Pass needed config to MessageSender
   CLOCK: [2014-12-24 Wed 18:49]--[2014-12-24 Wed 19:09] =>  0:20
** DONE Load the "from" phone number from config file
   CLOCK: [2014-12-24 Wed 11:49]--[2014-12-24 Wed 12:11] =>  0:22
** DONE Setup Backbone/Marionette app
*** Is this needed?
- yeah, it's nice to see things update as they happen instead of going through a refresh cycle.
*** Maybe do SPA as a stretch goal
- no just keep it simple
** TODO Backbone should prune list of enqueued messages
- set a timer when one is made?
- constantly check with the current list?
- should i poll /sms for new messages submitted by other people?
** DONE Should load Twilio dev tokens from config.json
** DONE should put all logs to /logs folder
** DONE Change submission to take a delta into the future instead of absolute date
- minutes, days, weeks
- simple dropdowns

** DONE User can submit a future message [3/3]
*** DONE message is a phone number, text, and date
*** DONE message is stored in a priortity queue based on date
*** DONE have a Resource to view submitted messages to verify they were saved

** TODO Validate that message length is below a maximum
- SMS can be only 160 chars
- Twilio trial account starts with a 38 char message 
** TODO Better validation in general
- frontend should react when a bad form is submitted
- should check that number being submitted is valid 
  - valid for USA or the world?
** DONE Set a max length in config file

* Notes

** Don't consider timezones
Uhh, timezones. Always giving problems.
The server will run in whatever timezone, and everything will be considerd in that timezone.

*** TODO Does Twilio provide timezone of message that is received?
something to read in the docs or talk to people
